Repository: DevTeam/Pure.DI
Catalog: src/Pure.DI.Core/Strings.*.resx
Languages: ar, bn, de, es, fr, he, hi, id, it, ja, ko, pt, ru, th, vi, zh

# Warning_NoRoots
source: None of the composition roots are declared. Add at least one root.
ar: لم يتم التصريح عن أي من جذور التكوين (composition roots). أضف جذراً واحداً على الأقل.
bn: কোনো Composition Root ঘোষণা করা হয়নি। অন্তত একটি Root যোগ করুন।
de: Es wurden keine Composition Roots deklariert. Fügen Sie mindestens einen Root hinzu.
es: No se ha declarado ninguna Composition Root. Añada al menos una.
fr: Aucune racine de composition déclarée. Ajoutez au moins une racine.
he: לא הוצהר על שום Composition Root. הוסף לפחות Root אחד.
hi: कोई भी composition roots घोषित नहीं किया गया है। कम से कम एक root जोड़ें।
id: Tidak ada Composition Root yang dideklarasikan. Tambahkan setidaknya satu Root.
it: Nessuna Composition Root dichiarata. Aggiungerne almeno una.
ja: Composition root が宣言されていません。少なくとも 1 つの root を追加してください。
ko: Composition Root가 선언되지 않았습니다. 하나 이상의 Root를 추가하세요.
pt: Nenhuma raiz de composição foi declarada. Adicione pelo menos uma raiz.
ru: Ни один из корней композиции не объявлен. Добавьте хотя бы один корень.
th: ไม่มีการประกาศ Composition Root ใดๆ โปรดเพิ่มอย่างน้อยหนึ่งรูท
vi: Không có Composition Root nào được khai báo. Hãy thêm ít nhất một root.
zh: 未声明任何组合根。请至少添加一个根。

# Error_Template_InvalidCompositionTypeName
source: Invalid composition type name "{0}".
ar: اسم نوع التكوين "{0}" غير صالح.
bn: অমান্য Composition টাইপ নাম "{0}"।
de: Ungültiger Name für den Composition-Typ "{0}".
es: El nombre del tipo de composición "{0}" no es válido.
fr: Nom de type de composition invalide "{0}".
he: שם סוג קומפוזיציה לא חוקי "{0}".
hi: अमान्य composition type नाम "{0}"।
id: Nama tipe komposisi tidak valid "{0}".
it: Nome del tipo di composizione "{0}" non valido.
ja: Composition 型名 "{0}" が無効です。
ko: 유효하지 않은 컴포지션 유형 이름 "{0}"입니다.
pt: Nome de tipo de composição inválido "{0}".
ru: Недопустимое имя типа композиции "{0}".
th: ชื่อประเภท composition "{0}" ไม่ถูกต้อง
vi: Tên kiểu composition "{0}" không hợp lệ.
zh: 组合类型名称 "{0}" 无效。

# Error_Template_InvalidRootName
source: Invalid root name "{0}".
ar: اسم الجذر "{0}" غير صالح.
bn: অমান্য Root নাম "{0}"।
de: Ungültiger Root-Name "{0}".
es: El nombre del Root "{0}" no es válido.
fr: Nom de racine invalide "{0}".
he: שם Root לא חוקי "{0}".
hi: अमान्य root नाम "{0}"।
id: Nama Root tidak valid "{0}".
it: Nome del Root "{0}" non valido.
ja: Root 名 "{0}" が無効です。
ko: 유효하지 않은 Root 이름 "{0}"입니다.
pt: Nome de raiz inválido "{0}".
ru: Недопустимое имя корня "{0}".
th: ชื่อรูท "{0}" ไม่ถูกต้อง
vi: Tên root "{0}" không hợp lệ.
zh: 根名称 "{0}" 无效。

# Error_Template_RootDuplicate
source: The composition root "{0}" duplicates the previously declared root "{1}".
ar: جذر التكوين "{0}" يكرر جذراً تم التصريح عنه سابقاً "{1}".
bn: Composition Root "{0}" আগে ঘোষিত Root "{1}" এর ডুপ্লিকেট।
de: Der Composition Root "{0}" dupliziert einen zuvor deklarierten Root "{1}".
es: El Composition Root "{0}" duplica un Root declarado anteriormente "{1}".
fr: La racine de composition "{0}" duplique la racine précédemment déclarée "{1}".
he: ה-Composition Root "{0}" משכפל Root שהוצהר קודם לכן "{1}".
hi: Composition root "{0}" पहले से घोषित root "{1}" की पुनरावृत्ति करता है।
id: Composition Root "{0}" menduplikasi Root yang dideklarasikan sebelumnya "{1}".
it: La Composition Root "{0}" duplica un Root dichiarato in precedenza "{1}".
ja: Composition root "{0}" は、以前に宣言された root "{1}" と重複しています。
ko: Composition Root "{0}"이(가) 이전에 선언된 Root "{1}"와(과) 중복됩니다.
pt: A raiz de composição "{0}" duplica a raiz previamente declarada "{1}".
ru: Корень композиции "{0}" дублирует ранее объявленный корень "{1}".
th: Composition Root "{0}" ซ้ำกับรูท "{1}" ที่ประกาศไว้ก่อนหน้านี้
vi: Composition Root "{0}" trùng lặp với root "{1}" đã khai báo trước đó.
zh: 组合根 "{0}" 与之前声明的根 "{1}" 重复。

# Error_AccumulatorTypeCannotBeGenericTypeMarker
source: The accumulator type cannot be based on a generic type marker.
ar: لا يمكن أن يعتمد نوع المجمع (accumulator type) على علامة نوع عام (generic type marker).
bn: Accumulator টাইপ Generic Type Marker এর ওপর ভিত্তি করে হতে পারে না।
de: Der Accumulator-Typ kann nicht auf einem Generic Type Marker basieren.
es: El tipo de Accumulator no puede basarse en un Generic Type Marker.
fr: Le type d'accumulateur ne peut pas être basé sur un marqueur de type générique.
he: סוג ה-Accumulator לא יכול להתבסס על Generic Type Marker.
hi: Accumulator प्रकार generic type marker पर आधारित नहीं हो सकता।
id: Tipe Accumulator tidak boleh didasarkan pada Generic Type Marker.
it: Il tipo di Accumulator non può basarsi su un Generic Type Marker.
ja: Accumulator 型は generic type marker に基づくことはできません。
ko: Accumulator 유형은 Generic Type Marker를 기반으로 할 수 없습니다.
pt: O tipo acumulador não pode ser baseado em um marcador de tipo genérico.
ru: Тип аккумулятора не может быть основан на маркере обобщённого типа.
th: ประเภท Accumulator ไม่สามารถอ้างอิงจาก generic type marker ได้
vi: Kiểu Accumulator không thể dựa trên một generic type marker.
zh: 累加器 (accumulator) 类型不能基于泛型类型标记 (generic type marker)。

# Error_AccumulatorCannotAccumulateGenericTypeMarker
source: The accumulator cannot accumulate instances based on a generic type marker.
ar: لا يمكن للمجمع تراكم مثيلات تعتمد على علامة نوع عام.
bn: Accumulator, Generic Type Marker এর ওপর ভিত্তি করে ইনস্ট্যান্স সঞ্চয় করতে পারে না।
de: Der Accumulator kann keine Instanzen akkumulieren, die auf einem Generic Type Marker basieren.
es: El Accumulator no puede acumular instancias basadas en un Generic Type Marker.
fr: L'accumulateur ne peut pas accumuler d'instances basées sur un marqueur de type générique.
he: ה-Accumulator לא יכול לצבור מופעים המבוססים על Generic Type Marker.
hi: Accumulator generic type marker पर आधारित instances को संचित नहीं कर सकता।
id: Accumulator tidak dapat mengakumulasi instance berdasarkan Generic Type Marker.
it: L'Accumulator non può accumulare istanze basate su un Generic Type Marker.
ja: Accumulator は generic type marker に基づくインスタンスを蓄積することはできません。
ko: Accumulator는 Generic Type Marker를 기반으로 하는 인스턴스를 누적할 수 없습니다.
pt: O acumulador não pode acumular instâncias baseadas em um marcador de tipo genérico.
ru: Аккумулятор не может накапливать экземпляры, основанные на маркере обобщённого типа.
th: Accumulator ไม่สามารถสะสมอินสแตนซ์ที่อ้างอิงจาก generic type marker ได้
vi: Accumulator không thể tích lũy các instance dựa trên generic type marker.
zh: 累加器不能累加基于泛型类型标记的实例。

# Error_Template_InvalidArgumentName
source: Invalid argument name "{0}".
ar: اسم الوسيط (argument) "{0}" غير صالح.
bn: অমান্য আর্গুমেন্ট নাম "{0}"।
de: Ungültiger Argumentname "{0}".
es: El nombre del argumento "{0}" no es válido.
fr: Nom d'argument invalide "{0}".
he: שם ארגומנט לא חוקי "{0}".
hi: अमान्य argument नाम "{0}"।
id: Nama argumen tidak valid "{0}".
it: Nome dell'argomento "{0}" non valido.
ja: Argument 名 "{0}" が無効です。
ko: 유효하지 않은 인수 이름 "{0}"입니다.
pt: Nome de argumento inválido "{0}".
ru: Недопустимое имя аргумента "{0}".
th: ชื่ออาร์กิวเมนต์ "{0}" ไม่ถูกต้อง
vi: Tên đối số "{0}" không hợp lệ.
zh: 参数名称 "{0}" 无效。

# Error_InvalidBindingDueToCompilationError
source: Invalid binding due to compilation error.
ar: ارتباط (binding) غير صالح بسبب خطأ في التحويل البرمجي.
bn: কম্পাইলেশন ত্রুটির কারণে অমান্য Binding।
de: Ungültiges Binding aufgrund eines Kompilierungsfehlers.
es: Binding no válido debido a un error de compilación.
fr: Liaison invalide due à une erreur de compilation.
he: Binding לא חוקי עקב שגיאת הידור.
hi: compilation त्रुटि के कारण अमान्य binding।
id: Binding tidak valid karena kesalahan kompilasi.
it: Binding non valido a causa di un errore di compilazione.
ja: コンパイルエラーのため、Binding が無効です。
ko: 컴파일 오류로 인해 유효하지 않은 Binding입니다.
pt: Associação inválida devido a erro de compilação.
ru: Недопустимая привязка из-за ошибки компиляции.
th: Binding ไม่ถูกต้องเนื่องจากข้อผิดพลาดในการคอมไพล์
vi: Binding không hợp lệ do lỗi biên dịch.
zh: 由于编译错误，绑定无效。

# Error_Template_NotImplement
source: {0} does not implement {1}.
ar: {0} لا ينفذ {1}.
bn: {0}, {1} ইমপ্লিমেন্ট করে না।
de: {0} implementiert nicht {1}.
es: {0} no implementa {1}.
fr: {0} n'implémente pas {1}.
he: {0} לא מממש את {1}.
hi: {0}, {1} को लागू (implement) नहीं करता है।
id: {0} tidak mengimplementasikan {1}.
it: {0} non implementa {1}.
ja: {0} は {1} を実装していません。
ko: {0}은(는) {1}을(를) 구현하지 않습니다.
pt: {0} não implementa {1}.
ru: {0} не реализует {1}.
th: {0} ไม่ได้ใช้ {1}
vi: {0} không triển khai {1}.
zh: {0} 未实现 {1}。

# Error_Template_CyclicDependency
source: Cyclic dependency has been found: {0}.
ar: تم اكتشاف تبعية دائرية: {0}.
bn: Cyclic dependency পাওয়া গেছে: {0}।
de: Zyklische Abhängigkeit gefunden: {0}.
es: Se ha detectado una dependencia cíclica: {0}.
fr: Dépendance cyclique détectée : {0}.
he: נמצאה תלות מחזורית: {0}.
hi: चक्रीय निर्भरता (cyclic dependency) पाई गई: {0}।
id: Ditemukan ketergantungan siklik: {0}.
it: Rilevata dipendenza ciclica: {0}.
ja: 循環依存関係が検出されました: {0}。
ko: 순환 종속성이 발견되었습니다: {0}.
pt: Dependência cíclica encontrada: {0}.
ru: Обнаружена циклическая зависимость: {0}.
th: พบการพึ่งพาแบบวงกลม: {0}
vi: Phát hiện phụ thuộc vòng: {0}.
zh: 发现循环依赖：{0}。

# Error_Template_UnableToResolve
source: Unable to resolve "{0}" in {1}.
ar: تعذر حل "{0}" في {1}.
bn: {1}-এ "{0}" রিজলভ করা সম্ভব হয়নি।
de: "{0}" in {1} konnte nicht aufgelöst werden.
es: No se ha podido resolver "{0}" en {1}.
fr: Impossible de résoudre "{0}" dans {1}.
he: לא ניתן לפתור את "{0}" ב-{1}.
hi: {1} में "{0}" को हल करने में असमर्थ।
id: Gagal menyelesaikan "{0}" di {1}.
it: Impossibile risolvere "{0}" in {1}.
ja: {1} 内で "{0}" を解決できません。
ko: {1}에서 "{0}"을(를) 해석할 수 없습니다.
pt: Não foi possível resolver "{0}" em {1}.
ru: Не удалось разрешить "{0}" в {1}.
th: ไม่สามารถแก้ไข "{0}" ใน {1} ได้
vi: Không thể giải quyết "{0}" trong {1}.
zh: 无法在 {1} 中解析 "{0}"。

# Error_CannotBuildDependencyGraph
source: Cannot build a dependency graph.
ar: تعذر بناء مخطط التبعيات (dependency graph).
bn: Dependency Graph তৈরি করা সম্ভব নয়।
de: Der Dependency Graph kann nicht erstellt werden.
es: No se puede construir el Dependency Graph.
fr: Impossible de construire un graphe de dépendances.
he: לא ניתן לבנות את ה-Dependency Graph.
hi: Dependency graph बनाना संभव नहीं है।
id: Tidak dapat membangun Dependency Graph.
it: Impossibile creare il Dependency Graph.
ja: Dependency graph を構築できません。
ko: Dependency Graph를 빌드할 수 없습니다.
pt: Não é possível construir um gráfico de dependências.
ru: Невозможно построить граф зависимостей.
th: ไม่สามารถสร้าง Dependency Graph ได้
vi: Không thể xây dựng Dependency Graph.
zh: 无法构建依赖图 (dependency graph)。

# Error_Template_InvalidRegularExpression
source: Invalid regular expression {0}: "{1}".
ar: تعبير نمطي غير صالح {0}: "{1}".
bn: অমান্য রেগুলার এক্সপ্রেশন {0}: "{1}"।
de: Ungültiger regulärer Ausdruck {0}: "{1}".
es: Expresión regular no válida {0}: "{1}".
fr: Expression régulière invalide {0} : "{1}".
he: ביטוי רגולרי לא חוקי {0}: "{1}".
hi: अमान्य regular expression {0}: "{1}"।
id: Ekspresi reguler tidak valid {0}: "{1}".
it: Espressione regolare non valida {0}: "{1}".
ja: 無効な正規表現 {0}: "{1}"。
ko: 유효하지 않은 정규식 {0}: "{1}"입니다.
pt: Expressão regular inválida {0}: "{1}".
ru: Недопустимое регулярное выражение {0}: "{1}".
th: นิพจน์ระบุขอบเขต (regular expression) ไม่ถูกต้อง {0}: "{1}"
vi: Biểu thức chính quy không hợp lệ {0}: "{1}".
zh: 无效的正规表达式 {0}："{1}"。

# Error_Template_InvalidWildcard
source: Invalid wildcard {0}: "{1}".
ar: قناع (wildcard) غير صالح {0}: "{1}".
bn: অমান্য Wildcard {0}: "{1}"।
de: Ungültiges Wildcard {0}: "{1}".
es: Comodín (wildcard) no válido {0}: "{1}".
fr: Caractère générique invalide {0} : "{1}".
he: Wildcard לא חוקי {0}: "{1}".
hi: अमान्य wildcard {0}: "{1}"।
id: Wildcard tidak valid {0}: "{1}".
it: Wildcard non valida {0}: "{1}".
ja: 無効なワイルドカード {0}: "{1}"。
ko: 유효하지 않은 와일드카드 {0}: "{1}"입니다.
pt: Curinga inválido {0}: "{1}".
ru: Недопустимый шаблон {0}: "{1}".
th: Wildcard ไม่ถูกต้อง {0}: "{1}"
vi: Wildcard không hợp lệ {0}: "{1}".
zh: 无效的通配符 {0}："{1}"。

# Error_Template_TypeWithLifetimeRequiresDirectOrTransitiveInjection
source: Type {0} with lifetime {1} requires direct or transitive dependency injection of type {2} with lifetime {3}, which can lead to data leakage and unexpected behavior.
ar: النوع {0} مع Lifetime {1} يتطلب حقن تبعية مباشر أو عابر للنوع {2} مع Lifetime {3}، مما قد يؤدي إلى تسرب البيانات أو سلوك غير متوقع.
bn: Lifetime {1} সহ টাইপ {0}-এর জন্য Lifetime {3} সহ টাইপ {2}-এর সরাসরি বা ট্রানজিটিভ ইনজেকশন প্রয়োজন, যা ডেটা লিক বা অপ্রত্যাশিত আচরণের কারণ হতে পারে।
de: Der Typ {0} mit dem Lifetime {1} erfordert die direkte oder transitive Injection des Typs {2} mit dem Lifetime {3}, was zu Datenlecks oder unerwartetem Verhalten führen kann.
es: El tipo {0} con Lifetime {1} requiere la Injection directa o transitiva del tipo {2} con Lifetime {3}, lo que puede provocar fugas de datos o comportamientos inesperados.
fr: Le type {0} avec durée de vie {1} nécessite une injection de dépendance directe ou transitive du type {2} avec durée de vie {3}, ce qui peut entraîner des fuites de données ou des comportements inattendus.
he: סוג {0} עם Lifetime {1} דורש Injection ישיר או טרנזיטיבי של סוג {2} עם Lifetime {3}, מה שעלול להוביל לדליפת נתונים או להתנהגות בלתי צפויה.
hi: Lifetime {1} वाले प्रकार {0} को Lifetime {3} वाले प्रकार {2} के प्रत्यक्ष या सक्रामक (transitive) injection की आवश्यकता है, जिससे डेटा रिसाव या अप्रत्याशित व्यवहार हो सकता है।
id: Tipe {0} dengan Lifetime {1} memerlukan Injection langsung atau transitif dari tipe {2} dengan Lifetime {3}, yang dapat menyebabkan kebocoran data atau perilaku yang tidak terduga.
it: Il tipo {0} con Lifetime {1} richiede l'Injection diretta o transitiva del tipo {2} con Lifetime {3}, il che potrebbe causare perdite di dati o comportamenti imprevisti.
ja: Lifetime {1} を持つ型 {0} には、Lifetime {3} を持つ型 {2} の直接的または推移的な Injection が必要ですが、これはデータ漏洩や予期しない動作につながる可能性があります。
ko: Lifetime이 {1}인 {0} 유형은 Lifetime이 {3}인 {2} 유형의 종속성을 직접 또는 전이적으로 Injection해야 합니다. 그렇지 않으면 데이터 유출이나 예기치 않은 동작이 발생할 수 있습니다.
pt: O tipo {0} com tempo de vida {1} requer injeção de dependência direta ou transitiva do tipo {2} com tempo de vida {3}, o que pode levar a vazamento de dados e comportamento inesperado.
ru: Тип {0} с временем жизни {1} требует прямого или транзитивного внедрения зависимости типа {2} с временем жизни {3}, что может привести к утечке данных или неожиданному поведению.
th: ประเภท {0} ที่มี Lifetime {1} จำเป็นต้องมีการ injection โดยตรงหรือแบบส่งต่อของประเภท {2} ที่มี Lifetime {3} ซึ่งอาจนำไปสู่การรั่วไหลของข้อมูลหรือพฤติกรรมที่ไม่คาดคิด
vi: Kiểu {0} với Lifetime {1} yêu cầu injection trực tiếp hoặc bắc cầu của kiểu {2} với Lifetime {3}, điều này có thể dẫn đến rò rỉ dữ liệu hoặc hành vi không mong đợi.
zh: 具有 Lifetime {1} 的类型 {0} 需要直接或传递注入具有 Lifetime {3} 的类型 {2}，这可能导致数据泄漏或意外行为。

# Error_Template_MaximumNumberOfIterations
source: The maximum number of iterations {0} was exceeded was exceeded when building the optimal dependency graph. Try to specify the dependency graph more accurately.
ar: تم تجاوز الحد الأقصى لعدد التكرارات {0} عند بناء مخطط التبعيات الأمثل. يرجى توضيح مخطط التبعيات.
bn: সর্বোত্তম Dependency Graph তৈরির সময় সর্বোচ্চ সংখ্যক ইটারেশন {0} অতিক্রম করেছে। Dependency Graph সংশোধন করুন।
de: Die maximale Anzahl von Iterationen {0} wurde beim Erstellen des optimalen Dependency Graphs überschritten. Verfeinern Sie den Dependency Graph.
es: Se ha superado el número máximo de iteraciones {0} al construir el Dependency Graph óptimo. Refine el Dependency Graph.
fr: Le nombre maximal d'itérations {0} a été dépassé lors de la construction du graphe de dépendances optimal. Précisez davantage le graphe de dépendances.
he: חריגה ממספר האיטרציות המרבי {0} בעת בניית ה-Dependency Graph האופטימלי. דייק את ה-Dependency Graph.
hi: इष्टतम dependency graph बनाते समय पुनरावृत्तियों (iterations) की अधिकतम संख्या {0} पार हो गई है। कृपया dependency graph को स्पष्ट करें।
id: Melebihi jumlah iterasi maksimum {0} saat membangun Dependency Graph yang optimal. Sempurnakan Dependency Graph.
it: Superato il numero massimo di iterazioni {0} durante la creazione del Dependency Graph ottimale. Affinare il Dependency Graph.
ja: 最適な dependency graph の構築中に最大反復回数 {0} を超えました。Dependency graph を詳細に指定してください。
ko: 최적의 Dependency Graph를 빌드하는 동안 최대 반복 횟수 {0}을(를) 초과했습니다. Dependency Graph를 구체화하세요.
pt: O número máximo de iterações {0} foi excedido ao construir o gráfico de dependências ideal. Tente especificar o gráfico com mais precisão.
ru: Превышено максимальное количество итераций {0} при построении оптимального графа зависимостей. Уточните граф зависимостей.
th: เกินจำนวนรอบการทำงานสูงสุด {0} ขณะสร้าง Dependency Graph ที่เหมาะสมที่สุด โปรดปรับปรุง Dependency Graph
vi: Vượt quá số lượng vòng lặp tối đa {0} khi xây dựng Dependency Graph tối ưu. Hãy tinh chỉnh Dependency Graph.
zh: 构建最佳依赖图时超过了最大迭代次数 {0}。请细化依赖图。

# Error_DependencyGraphConstractionFailure
source: It is not possible to construct a dependency graph.
ar: تعذر بناء مخطط التبعيات.
bn: Dependency Graph তৈরি করা সম্ভব নয়।
de: Der Dependency Graph kann не erstellt werden.
es: No se puede construir el Dependency Graph.
fr: Impossible de construire un graphe de dépendances.
he: לא ניתן לבנות את ה-Dependency Graph.
hi: Dependency graph बनाना संभव नहीं है।
id: Tidak dapat membangun Dependency Graph.
it: Impossibile creare il Dependency Graph.
ja: Dependency graph を構築できません。
ko: Dependency Graph를 빌드할 수 없습니다.
pt: Não é possível construir um gráfico de dependências.
ru: Невозможно построить граф зависимостей.
th: ไม่สามารถสร้าง Dependency Graph ได้
vi: Không thể xây dựng Dependency Graph.
zh: 无法构建依赖图。

# Error_Template_LifetimeDoesNotSupportCyclicDependencies
source: {0} lifetime does not support cyclic dependencies.
ar: الـ Lifetime {0} لا يدعم التبعيات الدائرية.
bn: Lifetime {0} সাইক্লিক ডিপেন্ডেন্সি সমর্থন করে না।
de: Das Lifetime {0} unterstützt keine zyklischen Abhängigkeiten.
es: El Lifetime {0} no admite dependencias cíclicas.
fr: La durée de vie {0} ne prend pas en charge les dépendances cycliques.
he: ה-Lifetime {0} אינו תומך בתלויות מחזוריות.
hi: Lifetime {0} चक्रीय निर्भरता का समर्थन नहीं करता है।
id: Lifetime {0} tidak mendukung ketergantungan siklik.
it: Il Lifetime {0} non supporta dipendenze cicliche.
ja: Lifetime {0} は循環依存関係をサポートしていません。
ko: Lifetime {0}은(는) 순환 종속성을 지원하지 않습니다.
pt: O tempo de vida {0} não suporta dependências cíclicas.
ru: Время жизни {0} не поддерживает циклические зависимости.
th: Lifetime {0} ไม่รองรับการพึ่งพาแบบวงกลม
vi: Lifetime {0} không hỗ trợ phụ thuộc vòng.
zh: Lifetime {0} 不支持循环依赖。

# Error_InvalidNumberOfInitializers
source: Invalid number of initializers.
ar: عدد غير صالح من المبدئيات (initializers).
bn: অমান্য সংখ্যক ইনিশিয়ালাইজার।
de: Ungültige Anzahl von Initialisierern.
es: Número de inicializadores no válido.
fr: Nombre d'initialiseurs invalide.
he: מספר אתחולים לא חוקי.
hi: initializers की अमान्य संख्या।
id: Jumlah initializer tidak valid.
it: Numero di inizializzatori non valido.
ja: 初期化子の数が無効です。
ko: 유효하지 않은 이니셜라이저 수입니다.
pt: Número inválido de inicializadores.
ru: Недопустимое количество инициализаторов.
th: จำนวนตัวเริ่มต้นไม่ถูกต้อง
vi: Số lượng bộ khởi tạo không hợp lệ.
zh: 初始值设定项数量无效。

# Error_Template_CannotUseContextDirectly
source: It is not possible to use "{0}" directly. Only its methods or properties can be used.
ar: لا يمكن استخدام "{0}" مباشرة. تتوفر فقط أساليبه (methods) أو خصائصه (properties).
bn: "{0}" সরাসরি ব্যবহার করা সম্ভব নয়। শুধুমাত্র এর মেথড বা প্রপার্টিগুলো ব্যবহারযোগ্য।
de: "{0}" kann nicht direkt verwendet werden. Nur seine Methoden oder Eigenschaften sind zugänglich.
es: No se puede utilizar "{0}" directamente. Sólo se puede acceder a sus métodos o propiedades.
fr: Impossible d'utiliser "{0}" directement. Seules ses méthodes ou propriétés sont utilisables.
he: לא ניתן להשתמש ב-"{0}" ישירות. רק המתודות או המאפיינים שלו נגישים.
hi: "{0}" का सीधे उपयोग करना संभव नहीं है। केवल इसके methods या properties ही उपलब्ध हैं।
id: Tidak dapat menggunakan "{0}" secara langsung. Hanya metode atau propertinya yang dapat diakses.
it: Impossibile utilizzare "{0}" direttamente. Sono accessibili solo i suoi metodi o proprietà.
ja: "{0}" を直接使用することはできません。そのメソッドまたはプロパティのみがアクセス可能です。
ko: "{0}"을(를) 직접 사용할 수 없습니다. 해당 메서드나 속성만 사용할 수 있습니다.
pt: Não é possível usar "{0}" diretamente. Apenas seus métodos ou propriedades podem ser usados.
ru: Невозможно использовать "{0}" напрямую. Доступны только его методы или свойства.
th: ไม่สามารถใช้ "{0}" โดยตรงได้ สามารถเข้าถึงได้เฉพาะเมธอดหรือคุณสมบัติของมันเท่านั้น
vi: Không thể sử dụng "{0}" trực tiếp. Chỉ các phương thức hoặc thuộc tính của nó mới có thể truy cập được.
zh: 不能直接使用 "{0}"。仅可访问其方法或属性。

# Error_InvalidRootType
source: Invalid root type.
ar: نوع جذر غير صالح.
bn: অমান্য Root টাইপ।
de: Ungültiger Root-Typ.
es: Tipo de Root no válido.
fr: Type de racine invalide.
he: סוג Root לא חוקי.
hi: अमान्य root प्रकार।
id: Tipe Root tidak valid.
it: Tipo di Root non valido.
ja: Root 型が無効です。
ko: 유효하지 않은 Root 유형입니다.
pt: Tipo de raiz inválido.
ru: Недопустимый тип корня.
th: ประเภทรูทไม่ถูกต้อง
vi: Kiểu root không hợp lệ.
zh: 无效的根类型。

# Error_InvalidRootsRype
source: Invalid roots type.
ar: نوع جذور غير صالح.
bn: অমান্য Roots টাইপ।
de: Ungültiger Roots-Typ.
es: Tipo de Roots no válido.
fr: Type de racines invalide.
he: סוג Roots לא חוקי.
hi: अमान्य roots प्रकार।
id: Tipe Roots tidak valid.
it: Tipo di Roots non valido.
ja: Roots 型が無効です。
ko: 유효하지 않은 Roots 유형입니다.
pt: Tipo de raízes inválido.
ru: Недопустимый тип корней.
th: ประเภทรูทไม่ถูกต้อง
vi: Kiểu các root không hợp lệ.
zh: 无效的根集合类型。

# Error_Template_NoTypeForWildcard
source: There is no type found that inherits from {0} whose name matches the "{1}" filter.
ar: لم يتم العثور على نوع يرث من {0} ويتوافق اسمه مع الفلتر "{1}".
bn: {0} থেকে ইনহেরিট করা এমন কোনো টাইপ পাওয়া যায়নি যার নাম ফিল্টার "{1}" এর সাথে মেলে।
de: Kein von {0} erbender Typ gefunden, dessen Name dem Filter "{1}" entspricht.
es: No se ha encontrado ningún tipo que herede de {0} y cuyo nombre coincida con el filtro "{1}".
fr: Aucun type héritant de {0} ne correspond au filtre "{1}".
he: לא נמצא סוג היורש מ-{0} ששמו תואם למסנן "{1}".
hi: {0} से विरासत में मिला कोई प्रकार नहीं मिला जिसका नाम फ़िल्टर "{1}" से मेल खाता हो।
id: Tidak ditemukan tipe yang diwarisi dari {0} yang namanya cocok dengan filter "{1}".
it: Nessun tipo ereditato da {0} trovato con un nome corrispondente al filtro "{1}".
ja: {0} を継承し、名前がフィルタ "{1}" に一致する型が見つかりませんでした。
ko: {0}에서 상속되고 필터 "{1}"와(과) 일치하는 이름을 가진 유형을 찾을 수 없습니다.
pt: Nenhum tipo encontrado que herde de {0} e corresponda ao filtro "{1}".
ru: Не найден тип, наследуемый от {0}, имя которого соответствует фильтру "{1}".
th: ไม่พบประเภทที่สืบทอดจาก {0} ที่มีชื่อตรงกับตัวกรอง "{1}"
vi: Không tìm thấy kiểu nào kế thừa từ {0} có tên khớp với bộ lọc "{1}".
zh: 未找到继承自 {0} 且名称符合过滤器 "{1}" 的类型。

# Error_InvalidBuildersType
source: Invalid builders type.
ar: نوع بناة غير صالح.
bn: অমান্য Builders টাইপ।
de: Ungültiger Builders-Typ.
es: Tipo de Builders no válido.
fr: Type de constructeurs invalide.
he: סוג Builders לא חוקי.
hi: अमान्य builders प्रकार।
id: Tipe Builders tidak valid.
it: Tipo di Builders non valido.
ja: Builders 型が無効です。
ko: 유효하지 않은 Builders 유형입니다.
pt: Tipo de construtores inválido.
ru: Недопустимый тип построителей.
th: ประเภทตัวสร้าง (builders) ไม่ถูกต้อง
vi: Kiểu các builder không hợp lệ.
zh: 无效的构建器 (builders) 类型。

# Error_InvalidBuilderType
source: Invalid builder type.
ar: نوع بناء غير صالح.
bn: অমান্য Builder টাইপ।
de: Ungültiger Builder-Typ.
es: Tipo de Builder no válido.
fr: Type de constructeur invalide.
he: סוג Builder לא חוקי.
hi: अमान्य builder प्रकार।
id: Tipe Builder tidak valid.
it: Tipo di Builder non valido.
ja: Builder 型が無効です。
ko: 유효하지 않은 Builder 유형입니다.
pt: Tipo de construtor inválido.
ru: Недопустимый тип построителя.
th: ประเภทตัวสร้าง (builder) ไม่ถูกต้อง
vi: Kiểu builder không hợp lệ.
zh: 无效的构建器 (builder) 类型。
