Repository: DevTeam/Pure.DI
Catalog: src/Pure.DI.Core/Strings.*.resx
Languages: ar, bn, de, es, fr, he, hi, id, it, ja, ko, pt, ru, th, vi, zh

# Error_UnhandledError
source: An unhandled error has occurred.
ar: حدث خطأ غير معالج.
bn: একটি আনহ্যান্ডেল ত্রুটি ঘটেছে।
de: Ein unbehandelter Fehler ist aufgetreten.
es: Se ha producido un error no controlado.
fr: Une erreur non gérée s'est produite.
he: אירעה שגיאה בלתי מטופלת.
hi: एक अनहैंडल्ड त्रुटि हुई।
id: Terjadi kesalahan yang tidak tertangani.
it: Si è verificato un errore non gestito.
ja: 処理されないエラーが発生しました。
ko: 처리되지 않은 오류가 발생했습니다.
pt: Ocorreu um erro não tratado.
ru: Произошла необработанная ошибка.
th: เกิดข้อผิดพลาดที่ไม่สามารถจัดการได้
vi: Đã xảy ra lỗi không được xử lý.
zh: 发生了未处理 thermal 错误。

# Error_TypeCannotBeInferred
source: Cannot determine type. Try specifying it explicitly.
ar: تعذر تحديد النوع. حاول تحديده صراحة.
bn: টাইপ নির্ধারণ করা সম্ভব নয়। এটি স্পষ্টভাবে নির্দিষ্ট করার চেষ্টা করুন।
de: Typ kann nicht ermittelt werden. Versuchen Sie, ihn explizit anzugeben.
es: No se puede determinar el tipo. Intente especificarlo explícitamente.
fr: Impossible de déterminer le type. Spécifiez-le explicitement.
he: לא ניתן להסיק את הסוג. נסה לציין אותו במפורש.
hi: प्रकार निर्धारित नहीं किया जा सकता। इसे स्पष्ट रूप से निर्दिष्ट करने का प्रयास करें।
id: Tipe tidak dapat ditentukan. Coba tentukan secara eksplisit.
it: Impossibile dedurre il tipo. Provare a specificarlo esplicitamente.
ja: 型を特定できません。明示的に指定してみてください。
ko: 유형을 유추할 수 없습니다. 명시적으로 지정해 보세요.
pt: Não foi possível determinar o tipo. Especifique-o explicitamente.
ru: Невозможно определить тип. Попробуйте указать его явно.
th: ไม่สามารถระบุประเภทได้ โปรดลองระบุอย่างชัดเจน
vi: Không thể xác định kiểu. Hãy thử chỉ định nó một cách rõ ràng.
zh: 无法确定类型。请尝试显式指定。

# Error_Template_StaicRootCannotUseLifetime
source: Static root {0} of type {1} cannot use lifetime {2} directly or through a dependency.
pt: A raiz estática {0} do tipo {1} não pode usar o tempo de vida {2} diretamente ou por meio de uma dependência.

# Error_ClassArgumentTypeCannotBeGenericTypeMarker
source: The class argument type cannot be based on a generic type marker.
ru: Тип аргумента класса не может быть основан на маркере обобщённого типа.
