Repository: DevTeam/Pure.DI
Catalog: src/Pure.DI.Core/Strings.*.resx
Languages: ar, bn, de, es, fr, he, hi, id, it, ja, ko, pt, ru, th, vi, zh

# Error_TooManyTypeParameters
source: Too many type parameters.
ar: عدد كبير جداً من معلمات النوع.
bn: প্রচুর টাইপ প্যারামিটার।
de: Zu viele Typparameter.
es: Demasiados параметров de tipo.
fr: Trop de paramètres de type.
he: יותר מדי פרמטרים של סוג.
hi: बहुत अधिक type parameters।
id: Terlalu banyak parameter tipe.
it: Troppi parametri di tipo.
ja: 型パラメータが多すぎます。
ko: 유형 매개변수가 너무 많습니다.
pt: Muitos parâmetros de tipo.
ru: Слишком много параметров типа.
th: มีพารามิเตอร์ประเภทมากเกินไป
vi: Quá nhiều tham số kiểu.
zh: 类型参数过多。

# Error_AsynchronousFactoryWithAsyncNotSupported
source: Asynchronous factory with the async keyword is not supported.
ar: المصنع غير المتزامن (asynchronous factory) مع الكلمة الأساسية async غير مدعوم.
bn: async কিওয়ার্ড সহ এসিনক্রোনাস ফ্যাক্টরি সমর্থিত নয়।
de: Asynchrone Factorys mit dem Schlüsselwort async werden nicht unterstützt.
es: No se admiten fábricas asíncronas con la palabra clave async.
fr: L'usine asynchrone avec le mot-clé async n'est pas prise en charge.
he: מפעלים אסינכרוניים עם מילת המפתח async אינם נתמכים.
hi: async कीवर्ड के साथ असिंक्रोनस फ़ैक्टरी (asynchronous factory) समर्थित नहीं है।
id: Factory asinkron dengan kata kunci async tidak didukung.
it: Le factory asincrone con la parola chiave async non sono supportate.
ja: async キーワードを使用した非同期ファクトリはサポートされていません。
ko: async 키워드를 사용하는 비동기 팩토리는 지원되지 않습니다.
pt: Fábrica assíncrona com a palavra-chave async não é suportada.
ru: Асинхронная фабрика с ключевым словом async не поддерживается.
th: ไม่รองรับ Factory แบบอะซิงโครนัสที่ใช้คีย์เวิร์ด 'async'
vi: Factory bất đồng bộ với từ khóa 'async' không được hỗ trợ.
zh: 不支持带有 async 关键字的异步工厂。

# Error_Template_NotSupported
source: {0} is not supported.
ar: {0} غير مدعوم.
bn: {0} সমর্থিত নয়।
de: {0} wird nicht unterstützt.
es: {0} no es compatible.
fr: {0} n'est pas pris en charge.
he: {0} אינו נתמך.
hi: {0} समर्थित नहीं है।
id: {0} tidak didukung.
it: {0} non è supportato.
ja: {0} はサポートされていません。
ko: {0}은(는) 지원되지 않습니다.
pt: {0} não é suportado.
ru: {0} не поддерживается.
th: ไม่รองรับ {0}
vi: {0} không được hỗ trợ.
zh: 不支持 {0}。

# Error_Template_MustBeValueOfType
source: {0} must be a non-null value of type {1}.
ar: يجب أن يكون {0} قيمة غير فارغة من النوع {1}.
bn: {0} অবশ্যই টাইপ {1}-এর একটি নন-নাল ভ্যালু হতে হবে।
de: {0} muss ein Wert vom Typ {1} sein, der nicht null ist.
es: {0} debe ser un valor no nulo de tipo {1}.
fr: {0} doit être une valeur non nulle du type {1}.
he: {0} חייב להיות ערך שאינו null מסוג {1}.
hi: {0} प्रकार {1} का एक non-null मान होना चाहिए।
id: {0} harus berupa nilai non-null dari tipe {1}.
it: {0} deve essere un valore non nullo di tipo {1}.
ja: {0} は型 {1} の null ではない値である必要があります。
ko: {0}은(는) {1} 유형의 null이 아닌 값이어야 합니다.
pt: {0} deve ser um valor não nulo do tipo {1}.
ru: {0} должен быть ненулевым значением типа {1}.
th: {0} ต้องเป็นค่าที่ไม่ใช่ค่าว่างของประเภท {1}
vi: {0} phải là một giá trị không null của kiểu {1}.
zh: {0} 必须是类型 {1} 的非空值。

# Error_Template_InvalidIdentifier
source: Invalid identifier "{0}".
ar: معرف غير صالح "{0}".
bn: অমান্য আইডেন্টিফায়ার "{0}"।
de: Ungültiger Bezeichner "{0}".
es: Identificador "{0}" no válido.
fr: Identificateur invalide "{0}".
he: מזהה לא חוקי "{0}".
hi: अमान्य identifier "{0}"।
id: Identifier tidak valid "{0}".
it: Identificatore "{0}" non valido.
ja: 識別子 "{0}" が無効です。
ko: 유효하지 않은 식별자 "{0}"입니다.
pt: Identificador inválido "{0}".
ru: Недопустимый идентификатор "{0}".
th: ตัวระบุไม่ถูกต้อง "{0}"
vi: Định danh không hợp lệ "{0}".
zh: 无效的标识符 "{0}"。

# Error_Template_InvalidAttributeArgumentPosition
source: The argument position {0} of attribute {1} is out of range [0..{2}].
ar: موضع الوسيط {0} للسمة {1} خارج النطاق [0..{2}].
bn: অ্যাট্রিবিউট {1}-এর আর্গুমেন্ট {0}-এর অবস্থান [0..{2}] সীমার বাইরে।
de: Die Argumentposition {0} des Attributs {1} liegt außerhalb des Bereichs [0..{2}].
es: La posición del argumento {0} del atributo {1} está fuera del rango [0..{2}].
fr: La position d'argument {0} de l'attribut {1} est hors de la plage [0..{2}].
he: מיקום הארגומנט {0} של ה-Attribute {1} נמצא מחוץ לטווח [0..{2}].
hi: Attribute {1} की Argument स्थिति {0} रेंज [0..{2}] से बाहर है।
id: Posisi argumen {0} dari atribut {1} berada di luar rentang [0..{2}].
it: La posizione dell'argomento {0} dell'Attribute {1} è fuori dall'intervallo [0..{2}].
ja: 属性 {1} の引数の位置 {0} が範囲 [0..{2}] 外です。
ko: Attribute {1}의 인수 {0} 위치가 범위를 벗어났습니다 [0..{2}].
pt: A posição do argumento {0} do atributo {1} está fora do intervalo [0..{2}].
ru: Позиция аргумента {0} атрибута {1} находится вне диапазона [0..{2}].
th: ตำแหน่งอาร์กิวเมนต์ {0} ของ attribute {1} อยู่นอกช่วง [0..{2}]
vi: Vị trí của đối số {0} của attribute {1} nằm ngoài phạm vi [0..{2}].
zh: 属性 {1} 的参数位置 {0} 超出范围 [0..{2}]。

# Error_Template_AttributeMemberCannotBeProcessed
source: {0} of the type {1} cannot be processed because it is marked with multiple mutually exclusive attributes.
ar: لا يمكن معالجة {0} من النوع {1} لأنه مميز بسمات متعددة حصرية متبادلة.
bn: টাইপ {1}-এর {0} প্রসেস করা সম্ভব নয় কারণ এটি একাধিক পরস্পরবিরোধী অ্যাট্রিবিউট দ্বারা চিহ্নিত।
de: {0} vom Typ {1} kann nicht verarbeitet werden, da er mit mehreren sich gegenseitig ausschließenden Attributen markiert ist.
es: {0} de tipo {1} no puede procesarse porque está marcado con varios atributos mutuamente excluyentes.
fr: {0} du type {1} ne peut pas être traité car il est marqué par plusieurs attributs mutuellement exclusifs.
he: לא ניתן לעבד את {0} מסוג {1} מכיוון שהוא מסומן במספר Attributes המוציאים זה את זה.
hi: प्रकार {1} के {0} को संसाधित नहीं किया जा सकता क्योंकि यह कई परस्पर अनन्य (mutually exclusive) attributes के साथ चिह्नित है।
id: {0} bertipe {1} tidak dapat diproses karena ditandai dengan beberapa atribut yang saling eksklusif.
it: {0} di tipo {1} non può essere elaborato perché contrassegnato con più Attribute mutuamente esclusivi.
ja: 型 {1} の {0} は、複数の相互に排他的な属性でマークされているため、処理できません。
ko: {1} 유형의 {0}은(는) 상호 배타적인 여러 Attribute가 지정되어 있어 처리할 수 없습니다.
pt: {0} do tipo {1} não pode ser processado porque está marcado com múltiplos atributos mutuamente exclusivos.
ru: {0} типа {1} не может быть обработан, так как помечен несколькими взаимоисключающими атрибутами.
th: {0} ของประเภท {1} ไม่สามารถประมวลผลได้ เนื่องจากมีการระบุ attribute ที่ขัดแย้งกันหลายรายการ
vi: {0} của kiểu {1} không thể xử lý được vì nó được đánh dấu bằng nhiều attribute loại trừ lẫn nhau.
zh: 无法处理类型为 {1} 的 {0}，因为它被标记了多个互斥属性。

# Error_InvalidBinding
source: The binding is defined incorrectly.
ar: تم تعريف الارتباط (binding) بشكل غير صحيح.
bn: Binding ভুলভাবে সংজ্ঞায়িত করা হয়েছে।
de: Das Binding ist falsch definiert.
es: El Binding está definido incorrectamente.
fr: La liaison est incorrectement définie.
he: ה-Binding מוגדר באופן שגוי.
hi: Binding गलत तरीके से परिभाषित की गई है।
id: Binding tidak didefinisikan dengan benar.
it: Il Binding non è definito correttamente.
ja: Binding が正しく定義されていません。
ko: Binding이 올바르게 정의되지 않았습니다.
pt: A associação está definida incorretamente.
ru: Привязка определена некорректно.
th: มีการกำหนด Binding ไม่ถูกต้อง
vi: Binding được xác định không chính xác.
zh: 绑定定义不正确。

# Error_Template_TooLargeComposition
source: The composition is too large. Stopped on the #{0} dependency.
ar: التكوين كبير جداً. توقف عند التبعية رقم {0}.
bn: Composition অনেক বড়। ডিপেন্ডেন্সি নং {0}-এ থামানো হয়েছে।
de: Die Composition ist zu groß. Gestoppt bei Abhängigkeit Nr. {0}.
es: La composición es demasiado grande. Se detuvo en la dependencia nº {0}.
fr: La composition est trop volumineuse. Arrêté sur la dépendance #{0}.
he: הקומפוזיציה גדולה מדי. נעצר בתלות מס' {0}.
hi: Composition बहुत बड़ी है। निर्भरता संख्या {0} पर रुक गया।
id: Komposisi terlalu besar. Dihentikan pada dependensi #{0}.
it: La composizione è troppo grande. Arrestata alla dipendenza n. {0}.
ja: Composition が大きすぎます。依存関係番号 {0} で停止しました。
ko: 컴포지션이 너무 큽니다. 종속성 #{0}에서 중단되었습니다.
pt: A composição é muito grande. Parado na dependência #{0}.
ru: Композиция слишком велика. Остановлено на зависимости №{0}.
th: Composition มีขนาดใหญ่เกินไป หยุดที่การพึ่งพาที่ #{0}
vi: Composition quá lớn. Đã dừng tại phụ thuộc #{0}.
zh: 组合过大。已在依赖项 #{0} 处停止。

# Error_Template_CannotConstructAbstractType
source: An instance of {0} cannot be constructed because it is an abstract type.
ar: لا يمكن إنشاء مثيل من {0} لأنه نوع مجرد (abstract type).
bn: {0}-এর ইনস্ট্যান্স তৈরি করা সম্ভব নয় কারণ এটি একটি অ্যাবস্ট্রাক্ট টাইপ।
de: Instanz von {0} kann nicht erstellt werden, da es ein abstrakter Typ ist.
es: No se puede crear una instancia de {0} porque es un tipo abstracto.
fr: Impossible de construire une instance de {0} car c'est un type abstrait.
he: לא ניתן ליצור מופע של {0} מכיוון שזהו סוג מופשט.
hi: {0} का instance नहीं बनाया जा सकता क्योंकि यह एक abstract प्रकार है।
id: Tidak dapat membuat instance dari {0} karena merupakan tipe abstrak.
it: Impossibile creare un'istanza di {0} perché è un tipo astratto.
ja: {0} は抽象型であるため、インスタンスを作成できません。
ko: {0}은(는) 추상 유형이므로 인스턴스를 생성할 수 없습니다.
pt: Não é possível construir uma instância de {0} porque é um tipo abstrato.
ru: Нельзя создать экземпляр {0}, так как это абстрактный тип.
th: ไม่สามารถสร้างอินสแตนซ์ของ {0} ได้เนื่องจากเป็นประเภทนามธรรม
vi: Không thể tạo instance của {0} vì nó là kiểu trừu tượng.
zh: 无法创建 {0} 的实例，因为它是抽象类型。

# Error_Template_CannotBeInstantiatedNoAccessibleConstructor
source: An instance of {0} cannot be instantiated due to no accessible constructor available.
ar: لا يمكن إنشاء مثيل من {0} لعدم توفر منشئ (constructor) يمكن الوصول إليه.
bn: অ্যাক্সেসযোগ্য কনস্ট্রাক্টর না থাকায় {0}-এর ইনস্ট্যান্স তৈরি করা সম্ভব নয়।
de: Instanz von {0} kann nicht erstellt werden, da kein zugänglicher Konstruktor verfügbar ist.
es: No se puede crear una instancia de {0} porque no hay ningún constructor accesible.
fr: Impossible d'instancier {0} en raison de l'absence de constructeur accessible.
he: לא ניתן ליצור מופע של {0} עקב חוסר בקונסטרקטור נגיש.
hi: {0} का instance नहीं बनाया जा सकता क्योंकि कोई सुलभ constructor उपलब्ध नहीं है।
id: Tidak dapat membuat instance dari {0} karena tidak ada konstruktor yang dapat diakses.
it: Impossibile creare un'istanza di {0} perché non è disponibile alcun costruttore accessibile.
ja: アクセス可能なコンストラクタがないため、{0} のインスタンスを作成できません。
ko: 사용 가능한 생성자가 없으므로 {0}의 인스턴스를 생성할 수 없습니다.
pt: Não é possível instanciar {0} devido à falta de um construtor acessível.
ru: Нельзя создать экземпляр {0} из-за отсутствия доступного конструктора.
th: ไม่สามารถสร้างอินสแตนซ์ของ {0} ได้เนื่องจากไม่มีคอนสตรัคเตอร์ที่เข้าถึงได้
vi: Không thể tạo instance của {0} vì không có constructor nào có thể truy cập được.
zh: 由于没有可访问的构造函数，无法实例化 {0}。

# Error_Template_UnsupportLanguage
source: {0} does not support C# {1}. Please use language version {2} or greater.
ar: {0} لا يدعم C# {1}. يرجى استخدام إصدار اللغة {2} أو أحدث.
bn: {0}, C# {1} সমর্থন করে না। ল্যাঙ্গুয়েজ ভার্সন {2} বা নতুন ব্যবহার করুন।
de: {0} unterstützt C# {1} nicht. Bitte verwenden Sie Sprachversion {2} oder neuer.
es: {0} no soporta C# {1}. Por favor, use la versión del lenguaje {2} o superior.
fr: {0} ne prend pas en charge C# {1}. Utilisez la version de langage {2} ou supérieure.
he: {0} אינו תומך ב-C# {1}. אנא השתמש בגרסת שפה {2} ומעלה.
hi: {0}, C# {1} का समर्थन नहीं करता है। कृपया भाषा संस्करण {2} या नया उपयोग करें।
id: {0} tidak mendukung C# {1}. Gunakan versi bahasa {2} atau yang lebih baru.
it: {0} non supporta C# {1}. Utilizzare la versione del linguaggio {2} o successiva.
ja: {0} は C# {1} をサポートしていません。言語バージョン {2} 以降を使用してください。
ko: {0}은(는) C# {1}을(를) 지원하지 않습니다. 언어 버전 {2} 이상을 사용하세요.
pt: {0} não suporta C# {1}. Use a versão da linguagem {2} ou superior.
ru: {0} не поддерживает C# {1}. Используйте версию языка {2} или новее.
th: {0} ไม่รองรับ C# {1} โปรดใช้เวอร์ชันภาษา {2} หรือใหม่กว่า
vi: {0} không hỗ trợ C# {1}. Vui lòng sử dụng phiên bản ngôn ngữ {2} hoặc mới hơn.
zh: {0} 不支持 C# {1}。请使用语言版本 {2} 或更高版本。

# Error_Template_CannotFindSetup
source: Cannot find setup "{0}".
ar: تعذر العثور على الإعداد (setup) "{0}".
bn: সেটআপ "{0}" পাওয়া যায়নি।
de: Setup "{0}" konnte nicht gefunden werden.
es: No se ha podido encontrar la configuración (setup) "{0}".
fr: Configuration "{0}" introuvable.
he: לא ניתן למצוא את ההגדרה "{0}".
hi: सेटअप "{0}" नहीं मिला।
id: Tidak dapat menemukan setup "{0}".
it: Impossibile trovare l'impostazione "{0}".
ja: セットアップ "{0}" が見つかりませんでした。
ko: 설정 "{0}"을(를) 찾을 수 없습니다.
pt: Não foi possível encontrar a configuração "{0}".
ru: Не удалось найти настройку "{0}".
th: ไม่พบการตั้งค่า "{0}"
vi: Không thể tìm thấy thiết lập "{0}".
zh: 找不到设置 "{0}"。

# Error_Template_NoAccessibleConstructor
source: There is no accessible non-static constructor of type {0} with an argument matching "{1}".
ar: لا يوجد منشئ غير ثابت يمكن الوصول إليه من النوع {0} مع وسيط يتوافق مع "{1}".
bn: "{1}" এর সাথে সামঞ্জস্যপূর্ণ আর্গুমেন্ট সহ টাইপ {0}-এর কোনো অ্যাক্সেসযোগ্য নন-স্ট্যাটিক কনস্ট্রাক্টর পাওয়া যায়নি।
de: Kein zugänglicher nicht-statischer Konstruktor des Typs {0} mit einem Argument gefunden, das "{1}" entspricht.
es: No se ha encontrado ningún constructor no estático accesible del tipo {0} con un argumento que coincida con "{1}".
fr: Aucun constructeur non statique accessible du type {0} ne correspond à l'argument "{1}".
he: אין קונסטרקטור לא סטטי נגיש מסוג {0} עם ארגומנט התואם ל-"{1}".
hi: "{1}" से मेल खाने वाले argument के साथ प्रकार {0} का कोई सुलभ गैर-स्थिर (non-static) constructor नहीं मिला।
id: Tidak ditemukan konstruktor non-statis yang dapat diakses dari tipe {0} dengan argumen yang cocok dengan "{1}".
it: Nessun costruttore non statico accessibile del tipo {0} con un argomento corrispondente a "{1}".
ja: "{1}" に一致する引数を持つ、アクセス可能な型 {0} の非静的コンストラクタが見つかりませんでした。
ko: "{1}"와(과) 일치하는 인수가 있는 {0} 유형의 사용 가능한 비정적 생성자가 없습니다.
pt: Não há um construtor não estático acessível do tipo {0} que corresponda ao argumento "{1}".
ru: Нет доступного нестатического конструктора типа {0} с аргументом, соответствующим "{1}".
th: ไม่พบคอนสตรัคเตอร์ที่ไม่ใช่สแตติกที่เข้าถึงได้ของประเภท {0} ที่มีอาร์กิวเมนต์ตรงกับ "{1}"
vi: Không tìm thấy constructor không tĩnh có thể truy cập được của kiểu {0} với đối số khớp với "{1}".
zh: 未找到具有匹配 "{1}" 参数的可访问类型 {0} 的非静态构造函数。

# Error_Template_NoAccessibleMethod
source: There is no accessible non-static method of type {0} with a name matching "{1}" an argument matching "{2}".
ar: لا توجد طريقة (method) غير ثابتة يمكن الوصول إليها من النوع {0} باسم "{1}" ووسيط يتوافق مع "{2}".
bn: "{2}" এর সাথে সামঞ্জস্যপূর্ণ আর্গুমেন্ট এবং "{1}" নাম সহ টাইপ {0}-এর কোনো অ্যাক্সেসযোগ্য নন-স্ট্যাটিক মেথড পাওয়া যায়নি।
de: Keine zugängliche nicht-statische Methode des Typs {0} mit dem Namen "{1}" und einem Argument gefunden, das "{2}" entspricht.
es: No se ha encontrado ningún método no estático accesible del tipo {0} con el nombre "{1}" y un argumento que coincida con "{2}".
fr: Aucune méthode non statique accessible du type {0} ne correspond au nom "{1}" et à l'argument "{2}".
he: אין מתודה לא סטטית נגישה מסוג {0} עם השם "{1}" וארגומנט התואם ל-"{2}".
hi: नाम "{1}" और argument "{2}" के साथ मेल खाने वाले प्रकार {0} का कोई सुलभ गैर-स्थिर (non-static) method नहीं मिला।
id: Tidak ditemukan metode non-statis yang dapat diakses dari tipe {0} dengan nama "{1}" dan argumen yang cocok dengan "{2}".
it: Nessun metodo non statico accessibile del tipo {0} con nome "{1}" e un argomento corrispondente a "{2}".
ja: 名前 "{1}" および "{2}" に一致する引数を持つ、アクセス可能な型 {0} の非静的メソッドが見つかりませんでした。
ko: 이름이 "{1}"이고 "{2}"와(과) 일치하는 인수가 있는 {0} 유형의 사용 가능한 비정적 메서드가 없습니다.
pt: Não há um método não estático acessível do tipo {0} que corresponda ao nome "{1}" e ao argumento "{2}".
ru: Нет доступного нестатического метода типа {0} с именем "{1}" и аргументом, соответствующим "{2}".
th: ไม่พบเมธอดที่ไม่ใช่สแตติกที่เข้าถึงได้ของประเภท {0} ที่มีชื่อ "{1}" และอาร์กิวเมนต์ตรงกับ "{2}"
vi: Không tìm thấy phương thức không tĩnh có thể truy cập được của kiểu {0} có tên "{1}" và đối số khớp với "{2}".
zh: 未找到具有名称 "{1}" 且参数匹配 "{2}" 的可访问类型 {0} 的非静态方法。

# Error_Template_NoAccessibleFieldOrProperty
source: There is no accessible non-static writable field or property matched with "{0}" of {1}.
ar: لا يوجد حقل أو خاصية غير ثابتة يمكن الوصول إليها من النوع {1} تتوافق مع "{0}".
bn: "{0}" এর সাথে সামঞ্জস্যপূর্ণ টাইপ {1}-এর কোনো অ্যাক্সেসযোগ্য নন-স্ট্যাটিক ফিল্ড বা প্রপার্টি পাওয়া যায়নি।
de: Kein zugängliches nicht-statisches Feld oder Eigenschaft des Typs {1} gefunden, das "{0}" entspricht.
es: No se ha encontrado ningún campo o propiedad no estática del tipo {1} que coincida con "{0}".
fr: Aucun champ ou propriété accessible en écriture non statique ne correspond à "{0}" pour {1}.
he: אין שדה או מאפיין לא סטטי נגיש מסוג {1} התואם ל-"{0}".
hi: प्रकार {1} का कोई सुलभ गैर-स्थिर field या property नहीं मिली जो "{0}" से मेल खाती हो।
id: Tidak ditemukan field atau properti non-statis yang dapat diakses dari tipe {1} yang cocok dengan "{0}".
it: Nessun campo o proprietà non statica accessibile del tipo {1} corrispondente a "{0}".
ja: "{0}" に一致する、アクセス可能な型 {1} の非静的フィールドまたはプロパティが見つかりませんでした。
ko: "{0}"와(과) 일치하는 {1} 유형의 사용 가능한 비정적 필드 또는 속성이 없습니다.
pt: Não há um campo ou propriedade gravável não estático acessível que corresponda a "{0}" de {1}.
ru: Нет доступного нестатического поля или свойства типа {1}, соответствующего "{0}".
th: ไม่พบฟิลด์หรือคุณสมบัติที่ไม่ใช่สแตติกที่เข้าถึงได้ของประเภท {1} ที่ตรงกับ "{0}"
vi: Không tìm thấy trường hoặc thuộc tính không tĩnh có thể truy cập được của kiểu {1} khớp với "{0}".
zh: 未找到与 "{0}" 匹配的可访问类型 {1} 的非静态字段或属性。

# Error_Template_MustBeApiCall
source: {0} must be a constant value of type {1} or a special API call.
ar: يجب أن يكون {0} قيمة ثابتة من النوع {1} أو استدعاء API خاص.
bn: {0} অবশ্যই টাইপ {1}-এর একটি কনস্ট্যান্ট ভ্যালু বা একটি বিশেষ API কল হতে হবে।
de: {0} muss ein konstanter Wert des Typs {1} oder ein spezieller API-Aufruf sein.
es: {0} debe ser un valor constante de tipo {1} o una llamada especial a la API.
fr: {0} doit être une valeur constante du type {1} ou un appel API spécial.
he: {0} חייב להיות ערך קבוע מסוג {1} או קריאת API מיוחדת.
hi: {0} प्रकार {1} का एक constant मान या एक विशेष API कॉल होना चाहिए।
id: {0} harus berupa nilai konstan bertipe {1} atau panggilan API khusus.
it: {0} deve essere un valore costante di tipo {1} o una chiamata API speciale.
ja: {0} は型 {1} の定数値、または特別な API 呼び出しである必要があります。
ko: {0}은(는) {1} 유형의 상수 값이거나 특수 API 호출이어야 합니다.
pt: {0} deve ser um valor constante do tipo {1} ou uma chamada de API especial.
ru: {0} должен быть константным значением типа {1} или специальным вызовом API.
th: {0} ต้องเป็นค่าคงที่ของประเภท {1} หรือเป็นการเรียกใช้ API พิเศษ
vi: {0} phải là một giá trị hằng số của kiểu {1} hoặc một lệnh gọi API đặc biệt.
zh: {0} 必须是类型 {1} 的常量值或特殊的 API 调用。

# Warning_BindingIsNotUsed
source: Binding is not used.
ar: الارتباط (binding) غير مستخدم.
bn: Binding ব্যবহার করা হয়নি।
de: Binding wird nicht verwendet.
es: El Binding no se utiliza.
fr: La liaison n'est pas utilisée.
he: ה-Binding אינו בשימוש.
hi: Binding का उपयोग नहीं किया गया है।
id: Binding tidak digunakan.
it: Il Binding non è utilizzato.
ja: Binding は使用されていません。
ko: Binding이 사용되지 않습니다.
pt: A associação não está sendo usada.
ru: Привязка не используется.
th: ไม่มีการใช้ Binding
vi: Binding không được sử dụng.
zh: 绑定未被使用。

# Warning_Template_RootCannotBeResolvedByResolveMethods
source: The root {0} cannot be resolved using Resolve methods due it has arguments {1}, so an exception will be thrown when trying to do it.
ar: لا يمكن حل الجذر {0} باستخدام طرق Resolve بسبب الوسائط {1}؛ سيتم طرح استثناء عند المحاولة.
bn: আর্গুমেন্ট {1} এর কারণে Resolve মেথড দ্বারা Root {0} রিজলভ করা সম্ভব নয়, তাই চেষ্টা করার সময় একটি এক্সেপশন থ্রো করা হবে।
de: Root {0} kann aufgrund der Argumente {1} nicht mit Resolve-Methoden aufgelöst werden; beim Versuch wird eine Ausnahme ausgelöst.
es: El Root {0} no se puede resolver mediante los métodos Resolve debido a los argumentos {1}; se lanzará una excepción al intentarlo.
fr: La racine {0} ne peut pas être résolue via les méthodes Resolve en raison des arguments {1}, une exception sera levée lors de la tentative.
he: לא ניתן לפתור את ה-Root {0} על ידי מתודות Resolve עקב הארגומנטים {1}, לכן תיזרק חריגה בעת הניסיון.
hi: Arguments {1} के कारण Root {0} को Resolve विधियों द्वारा हल नहीं किया जा सकता है; प्रयास करने पर एक अपवाद (exception) फेंका जाएगा।
id: Root {0} tidak dapat diselesaikan dengan metode Resolve karena argumen {1}, sehingga pengecualian akan dimunculkan saat mencoba melakukannya.
it: Il Root {0} non può essere risolto dai metodi Resolve a causa degli argomenti {1}, pertanto verrà generata un'eccezione al tentativo.
ja: 引数 {1} があるため、Root {0} を Resolve メソッドで解決できません。試行すると例外がスローされます。
ko: Root {0}은(는) 인수 {1}로 인해 Resolve 메서드로 해석할 수 없으므로 시도 시 예외가 발생합니다.
pt: A raiz {0} não pode ser resolvida usando métodos Resolve devido aos argumentos {1}, então uma exceção será lançada ao tentar.
ru: Корень {0} не может быть разрешён методами Resolve из-за аргументов {1}, поэтому при попытке будет выброшено исключение.
th: ไม่สามารถแก้ไขรูท {0} ด้วยเมธอด Resolve ได้เนื่องจากอาร์กิวเมนต์ {1} ดังนั้นจะมีการข้อยกเว้นเกิดขึ้นเมื่อพยายามดำเนินการ
vi: Root {0} không thể được giải quyết bằng các phương thức Resolve do các đối số {1}, vì vậy một ngoại lệ sẽ được ném ra khi cố gắng thực hiện.
zh: 由于存在参数 {1}，无法使用 Resolve 方法解析根 {0}；尝试时将引发异常。

# Warning_Template_InjectionSiteIsNotUsed
source: "{0}" of the tag on the injection site is not used.
ar: الوسم "{0}" في موقع الحقن (injection site) غير مستخدم.
bn: ইনজেকশন সাইটের ট্যাগ "{0}" ব্যবহৃত হচ্ছে না।
de: Das Tag "{0}" an der Injection Site wird не используется.
es: La etiqueta "{0}" en el Injection Site no se utiliza.
fr: "{0}" du tag sur le site d'injection n'est pas utilisé.
he: התגית "{0}" ב-Injection Site אינה בשימוש.
hi: Injection site पर टैग "{0}" का उपयोग नहीं किया गया है।
id: Tag "{0}" pada injection site tidak digunakan.
it: Il tag "{0}" nell'Injection Site non è utilizzato.
ja: Injection site のタグ "{0}" は使用されていません。
ko: Injection Site의 "{0}" 태그가 사용되지 않습니다.
pt: "{0}" da tag no local de injeção não está sendo usado.
ru: "{0}" тега на месте инъекции не используется.
th: แท็ก "{0}" ที่ตำแหน่ง injection ไม่ได้ถูกใช้งาน
vi: Tag "{0}" tại Injection Site không được sử dụng.
zh: 注入点 (injection site) 处的标签 "{0}" 未被使用。

# Warning_Template_BindingHasBeenOverridden
source: The binding for {0} has been overridden.
ar: تم تجاوز الارتباط لـ {0}.
bn: {0}-এর জন্য Binding ওভাররাইড করা হয়েছে।
de: Das Binding für {0} wurde überschrieben.
es: El Binding para {0} ha sido anulado.
fr: La liaison pour {0} a été remplacée.
he: ה-Binding עבור {0} נדרס.
hi: {0} के लिए Binding ओवरराइड कर दी गई है।
id: Binding untuk {0} telah diganti (overridden).
it: Il Binding per {0} è stato sovrascritto.
ja: {0} の Binding がオーバーライドされました。
ko: {0}에 대한 Binding이 재정의되었습니다.
pt: A associação para {0} foi substituída.
ru: Привязка для {0} была переопределена.
th: Binding สำหรับ {0} ถูกเขียนทับ
vi: Binding cho {0} đã bị ghi đè.
zh: {0} 的绑定已被重写。

# Info_CodeGenerationAborted
source: Code generation aborted.
ar: تم إحباط إنشاء الكود.
bn: কোড জেনারেশন বন্ধ করা হয়েছে।
de: Codegenerierung wurde abgebrochen.
es: Generación de código abortada.
fr: Génération de code annulée.
he: יצירת הקוד הופסקה.
hi: कोड जनरेशन रद्द कर दिया गया।
id: Pembuatan kode dibatalkan.
it: Generazione del codice interrotta.
ja: コード生成が中止されました。
ko: 코드 생성이 중단되었습니다.
pt: Geração de código abortada.
ru: Генерация кода прервана.
th: การสร้างโค้ดถูกยกเลิก
vi: Quá trình tạo mã đã bị hủy bỏ.
zh: 代码生成已中止。
